{
    "slug": "cybersecurity-interview",
    "title": "Cybersecurity Interview Questions: Defense & Analysis (2026)",
    "description": "Secure your career in CyberSec. 50+ interview questions covering Network Security, Cryptography, OWASP Top 10, Malware analysis, and Incident Response.",
    "heroBadge": "CyberSecurity Defense: 50+ Q&A",
    "sections": [
        {
            "title": "1. Core Security Concepts",
            "content": "**Q1: Explain the CIA Triad.**\nThe CIA Triad is the foundational model for information security. **Confidentiality:** Ensuring only authorized people have access to data (Encryption, Access Controls). **Integrity:** Ensuring data hasn't been tampered with or altered (Hashing, Digital Signatures). **Availability:** Ensuring data/services are accessible when needed (Redundancy, DDoS protection, Backups).\n\n**Q2: Symmetric vs. Asymmetric Encryption.**\n**Symmetric (Private Key):** Uses the *same* key for both encryption and decryption (e.g., AES). Fast, but key exchange is risky. **Asymmetric (Public Key):** Uses a pair of keys—Public to encrypt, Private to decrypt (e.g., RSA, ECC). Slower, but solves the key exchange problem. HTTPS uses Asymmetric for the handshake and Symmetric for the session data.\n\n**Q3: What is Hashing vs. Encryption?**\nEncryption is a two-way function; data is scrambled but can be restored (decrypted) with a key. Hashing is a one-way function; data is scrambled into a fixed-length string (digest) and cannot be reversed. Hashing is used for storing passwords (never store plain text!) and verifying file integrity.\n\n**Q4: What is Salt and Pepper in password storage?**\n**Salt:** A random string added to a password *before* hashing. It is unique per user and stored in the DB. It defends against Rainbow Table attacks (pre-computed hash lists). **Pepper:** A secret key added to the password before hashing. It is stored separately (e.g., in a config file/HSM), not in the DB, adding an extra layer of security if the DB is breached.\n\n**Q5: Explain the Principle of Least Privilege (PoLP).**\nUsers (or processes) should be granted the minimum level of access (privileges) necessary to perform their job functions. If a user only needs to read a file, do not give them write or admin access. This limits the blast radius if an account is compromised."
        },
        {
            "title": "2. Network Security",
            "content": "**Q6: How does a Firewall work?**\nA firewall is a network security device that monitors and filters incoming and outgoing network traffic based on an organization's previously established security policies. It acts as a barrier. Types include Packet Filtering (Layer 3), Stateful Inspection (tracks connection state), and Next-Gen Firewalls (NGFW) which include DPI (Deep Packet Inspection) and intrusion prevention.\n\n**Q7: Explain the 3-Way Handshake and SYN Flood attack.**\nNormal TCP connection: Client sends SYN, Server replies SYN-ACK, Client replies ACK. Connection established. **SYN Flood:** Attacker sends massive numbers of SYN packets but never sends the final ACK. The server reserves memory for each 'half-open' connection until it runs out of resources and crashes (Denial of Service). Defenses include SYN Cookies.\n\n**Q8: What is a VPN?**\nA Virtual Private Network works by creating an encrypted tunnel between a user's device and a remote server (VPN server). It masks the user's IP address and encrypts the data traffic, securing it from snooping on public Wi-Fi and allowing access to internal corporate networks securely over the internet.\n\n**Q9: IDS vs. IPS.**\n**IDS (Intrusion Detection System):** Monitors network traffic for suspicious activity and issues alerts (Passive). It's like a security camera. **IPS (Intrusion Prevention System):** Also monitors traffic but can actively block/prevent the threat by dropping packets or resetting connections (Active). It's like a security guard.\n\n**Q10: What is a DMZ?**\nA Demilitarized Zone is a physical or logical subnetwork that contains and exposes an organization's external-facing services (e.g., Web Server, Mail Server) to an untrusted network (Internet). It adds a layer of security; if the web server is compromised, the attacker still doesn't have direct access to the internal private network (LAN)."
        },
        {
            "title": "3. Web Application Security (OWASP)",
            "content": "**Q11: Explain SQL Injection (SQLi) and how to prevent it.**\nSQLi occurs when an attacker inserts malicious SQL code into input fields (like a search box) to manipulate the backend database (dumping data, deleting tables). Prevention: **Parameterized Queries (Prepared Statements)** is the gold standard. It ensures the DB treats user input as data, not executable code. Also, input validation.\n\n**Q12: What is XSS (Cross-Site Scripting)?**\nXSS happens when an application includes untrusted data in a web page without validation/escaping. This allows the attacker to execute malicious scripts in the *victim's* browser (stealing cookies, redirecting). **Reflected XSS:** Data in URL. **Stored XSS:** Data saved in DB (like a comment). Prevention: Content Security Policy (CSP) and Output Encoding.\n\n**Q13: CSRF (Cross-Site Request Forgery).**\nAn attack that tricks the victim into submitting a malicious request to a web app where they are currently authenticated (e.g., changing a password or transferring money). The server thinks the user intended the action. Prevention: Anti-CSRF Tokens (unique secret token validated on every state-changing request) and SameSite Cookie attributes.\n\n**Q14: Information Disclosure.**\nWhen an application unintentionally reveals sensitive information. Examples: detailed error messages (stack traces) revealed to users, leaving `.git` folders accessible, or exposing API keys in client-side code. Prevention: Generic error pages, disabling directory listing, scanning for secrets.\n\n**Q15: What is Broken Access Control?**\n(Current #1 on OWASP Top 10). When a user can act outside of their intended permissions. E.g., a standard user accessing `/admin/deleteUser` simply by guessing the URL (Insecure Direct Object Reference - IDOR). Prevention: Enforce access control checks on the *server-side* for every request, not just hiding UI buttons."
        },
        {
            "title": "4. Malware & Incident Response",
            "content": "**Q16: What is Ransomware?**\nA type of malware that encrypts a victim's files. The attacker then demands a ransom to restore access. Modern ransomware also threatens to leak the data (double extortion). Response: Isolate infected systems immediately. Do not pay (no guarantee). Restore from offline (immutable) backups.\n\n**Q17: Describe the Incident Response Life Cycle (NIST).**\n1. **Preparation:** Policies, tools, team training. 2. **Detection & Analysis:** Monitoring, triaging alerts. 3. **Containment, Eradication, & Recovery:** Stopping the spread, removing the threat, restoring systems. 4. **Post-Incident Activity:** Lessons learned (Post-Mortem) to improve future defense.\n\n**Q18: What is a Zero-Day Vulnerability?**\nA security flaw that is unknown to the software vendor or the public. The vendor has had 'zero days' to fix it. Exploits targeting these are highly valuable and dangerous because no patch exists. Defense relies on heuristics and defense-in-depth.\n\n**Q19: Man-in-the-Middle (MitM) Attack.**\nAn attacker intercepts communication between two parties (e.g., user and bank) to eavesdrop or modify traffic. Often happens on unsecured public Wi-Fi. Defense: Use HTTPS (TLS) and VPNs. Public Key Infrastructure (PKI) prevents this by verifying server identity via certificates.\n\n**Q20: Phishing vs. Spear Phishing.**\n**Phishing:** Sending generic mass emails posing as a legitimate company (e.g., 'Reset your Netflix password') to steal creds. **Spear Phishing:** Highly targeted attack against a specific individual/org using personalized info (e.g., emailing the CFO pretending to be the CEO asking for a wire transfer). **Whaling:** Spear phishing targeting C-level executives."
        },
        {
            "title": "5. Compliance & General",
            "content": "**Q21: What is GDPR/CCPA?**\nData privacy regulations (EU and California). They give individuals rights over their data (Right to Access, Right to be Forgotten). Companies must obtain consent for data collection and protect it. Non-compliance results in massive fines.\n\n**Q22: Use of 'traceroute' and 'ping'.**\n**Ping:** Uses ICMP Echo to check if a host is reachable and measures round-trip time (latency). **Traceroute:** Shows the path (hops) a packet takes to reach the destination. Useful for diagnosing network delays or routing loops.\n\n**Q23: How do you secure a Linux server?**\nDisable root login via SSH. Use Key-based authentication (disable passwords). Configure a firewall (UFW/iptables). Keep software updated (patching). Run services with dedicated non-root users. Install Fail2Ban.\n\n**Q24: What is Social Engineering?**\nThe art of manipulating people into giving up confidential information (hacking the human). It bypasses technical controls. Examples: Pretexting (lying about identity), Tailgating (following someone into a building), Baiting (leaving a USB drive).\n\n**Q25: Blue Team vs. Red Team.**\n**Red Team:** Offensive security. Simulates real-world attacks to test defenses (Ethical Hacking). **Blue Team:** Defensive security. Monitors, defends, and responds to attacks. **Purple Team:** Collaboration between the two to maximize learning."
        }
    ]
}