{
    "slug": "react-mid-level-interview-questions",
    "title": "50+ Advanced Mid-Level React Interview Questions (2026)",
    "description": "Bridge the gap between junior and senior. 50+ challenging React interview questions for mid-level developers covering architecture, testing, and performance.",
    "heroBadge": "Mid-Level Mastery: 50+ Q&A",
    "sections": [
        {
            "title": "Introduction: Beyond the Basics",
            "content": "For **Mid-Level React Developers**, interviews move away from simple definitions and into **implementation patterns**, **architecture**, and **optimization**. This guide covers 50+ questions designed to test your depth of knowledge in React version 19 and beyond.",
            "image": "/images/interviews/react-main.png"
        },
        {
            "title": "1. Architecture & Design Patterns (Q1-Q10)",
            "content": "**Q1: What are the differences between HOCs and Render Props?**\nBoth are patterns for code reuse. HOCs wrap a component, while Render Props pass a function as a child. Hooks have largely superseded both for most use cases.\n\n**Q2: Explain the 'Compound Component' pattern.**\nA pattern where several components work together to form a unit, sharing implicit state (like a Tabs or Select dropdown).\n\n**Q3: What is 'Inversion of Control' in React?**\nDesigning components that allow the consumer to decide the internal UI or logic (often via render props or composition).\n\n**Q4: How do you handle deep nested forms?**\nBy using libraries like Formik or React Hook Form combined with Context or a central state manager to avoid prop drilling.\n\n**Q5: When would you build a custom hook instead of an HOC?**\nWhen the logic is purely about data/state and doesn't involve modifying the component's UI structure directly.\n\n**Q6: Explain Module Federation in the context of React.**\nAllowing multiple independent React apps to share components or state at runtime (Micro-frontends).\n\n**Q7: Pros and cons of Micro-frontends?**\nPros: Independent scaling/deployment. Cons: Operational complexity, duplicated dependencies, and potential CSS conflicts.\n\n**Q8: How to manage global state without Redux?**\nUsing Context API, Zustand, MobX, or even simple native JS patterns combined with custom hooks.\n\n**Q9: What is 'Zustand' and why is it popular?**\nA small, fast, and scalable bear-bones state management solution that avoids the boilerplate of Redux.\n\n**Q10: Explain React's unidirectional data flow philosophy.**\nIt ensures data has a single source of truth and flows downwards, making state changes easier to trace and debug."
        },
        {
            "title": "2. Performance Optimization (Q11-Q20)",
            "content": "**Q11: How do you debug re-renders?**\nUsing the React DevTools Profiler to identify exactly which components are re-rendering and why.\n\n**Q12: What is 'Windowing' or 'Virtualization'?**\nOnly rendering the items currently visible in the viewport to handle massive lists efficiently (e.g., `react-window`).\n\n**Q13: How to optimize expensive calculations?**\nUsing the `useMemo` hook to cache results unless input dependencies change.\n\n**Q14: Avoiding anonymous functions in JSX props.**\nDefining functions outside the render loop or using `useCallback` to maintain referential equality across renders.\n\n**Q15: What are 'Transitional' updates in React 18/19?**\nUpdates that aren't urgent and can be interrupted or deferred to keep the main thread free for user interaction.\n\n**Q16: How to use 'useTransition' for heavy filtering?**\nWrapping the set state action in `startTransition` to allow the UI to remain responsive while the list filter finishes.\n\n**Q17: Explain 'Automatic Batching'.**\nReact 18+ batches state updates even inside promises, timeouts, and native event handlers.\n\n**Q18: What is 'Suspense' for Data Fetching?**\nA way for components to 'wait' for something (like data) before rendering, allowing for better loading state management.\n\n**Q19: How to reduce bundle size?**\nUsing code splitting (`React.lazy`), tree shaking, and analyzing the bundle with tools like Webpack Bundle Analyzer.\n\n**Q20: What is 'Tree Shaking'?**\nA build-step optimization that removes unused code from your final bundle."
        },
        {
            "title": "3. Testing & Tooling (Q21-Q30)",
            "content": "**Q21: Unit vs Integration vs E2E testing.**\nUnit: Testing a single function/component. Integration: Testing components working together. E2E: Testing the full user flow (Playwright/Cypress).\n\n**Q22: Why use React Testing Library (RTL) over Enzyme?**\nRTL encourages testing from the user's perspective (accessible queries) rather than implementation details.\n\n**Q23: How to test a custom hook?**\nUsing `renderHook` from `@testing-library/react` to test hook behavior in isolation.\n\n**Q24: What is 'Mocking' and why is it needed?**\nReplacing complex dependencies (like API calls) with fake versions to ensure tests are fast and deterministic.\n\n**Q25: Explain Mock Service Worker (MSW).**\nA tool that intercepts network requests at the browser/node layer, providing the most realistic API mocking.\n\n**Q26: What is 'Snapshot Testing'?**\nComparing the rendered output of a component against a previously saved version to detect unintended changes.\n\n**Q27: How to test components with Context?**\nBy wrapping the rendered component in a Provider during the test setup.\n\n**Q28: Importance of 'act()' in React testing.**\nEnsures that all updates (state, effects) have been processed before making test assertions.\n\n**Q29: Explaining CI/CD for React.**\nAutomating the build, test, and deployment process using tools like GitHub Actions or GitLab CI.\n\n**Q30: What is 'Strict Mode' in a real project?**\nA development-only tool that double-invokes effects and render logic to catch side-effect bugs early."
        },
        {
            "title": "4. Modern React Features (Q31-Q40)",
            "content": "**Q31: What are Server Components?**\nComponents that render exclusively on the server, reducing the amount of JavaScript sent to the client.\n\n**Q32: Server Components vs SSR.**\nSSR generates HTML but still sends JS for hydration. Server components don't send JS for the component itself.\n\n**Q33: What's new in React 19?**\nSupport for Actions, the `use` hook, and better integration with Web Components.\n\n**Q34: Explain the 'use' hook.**\nA new hook that can consume promises or context conditionally inside loops or if-statements.\n\n**Q35: What is a React 'Action'?**\nA way to handle form submissions and data mutations asynchronously with built-in loading and error states.\n\n**Q36: What is the 'useActionState' hook?**\nA hook designed to manage the result and pending state of a React Action.\n\n**Q37: What is 'useOptimistic'?**\nA hook that allows you to display a UI state optimistically before a server action completes.\n\n**Q38: How to handle errors in Server Components?**\nUsing Error Boundaries that wrap the hydration boundary or the server-component tree.\n\n**Q39: What is 'Selective Hydration'?**\nReact 18's ability to hydrate parts of the page independently based on user interaction.\n\n**Q40: Explain 'Streaming SSR'.**\nSending the HTML response in chunks rather than waiting for the entire page to render on the server."
        },
        {
            "title": "5. Logic & State Deep Dive (Q41-Q50)",
            "content": "**Q41: Implementing a 'Undo/Redo' feature.**\nBy maintaining a history stack of state snapshots and an index to navigate them.\n\n**Q42: How does 'Reconciliation' differ from 'Diffing'?**\nDiffing is the algorithm to find changes; Reconciliation is the whole process of generating and applying those changes to the tree.\n\n**Q43: Explaining 'Context Selector' problem.**\nWhen a context value changes, all consumers re-render even if they only need a small portion of that value.\n\n**Q44: How to deal with 'Zombie Children' in Redux?**\nAn edge case where child components try to access state that no longer exists; handled by modern Redux logic and architecture.\n\n**Q45: Explain the 'Fiber' architecture.**\nThe rewrite of React's core to support incremental rendering and concurrency.\n\n**Q46: What is a 'Work Loop' in React?**\nThe internal loop that processes tasks in the Fiber tree based on priority.\n\n**Q47: Dealing with 'Race Conditions' in useEffect.**\nUsing a boolean flag (or AbortController) inside the cleanup function to ignore stale API responses.\n\n**Q48: How to build a 'Sticky Header' without jumping?**\nUsing `useLayoutEffect` to measure positions before the screen paints.\n\n**Q49: Portals for accessibility (ARIA).**\nEnsuring that modals rendered via Portals maintain the correct focus trap and screen reader hierarchy.\n\n**Q50: Strategies for large-scale React codebase.**\nFeature-based folder structure, shared UI kits, and strict linting/Prettier rules.\n\n**Q51: What is the 'Double Render' in Dev?**\nReact intentionally renders twice in Strict Mode to help developers find impure components."
        },
        {
            "title": "Summary",
            "content": "A mid-level role is about **judgment**. Knowing *when* to use a hook versus a pattern is what sets you apart. Master these 50+ questions to secure your next career leap.",
            "image": "/images/interviews/react-main.png"
        }
    ]
}