{
    "slug": "react-interview-questions-for-freshers",
    "title": "50+ Essential React Interview Questions for Freshers (2026)",
    "description": "The ultimate guide for entry-level React developers. Over 50 carefully selected questions and answers to help freshers master their technical interviews.",
    "heroBadge": "Freshers Mega-Guide: 50+ Q&A",
    "sections": [
        {
            "title": "Introduction: Starting Your React Career",
            "content": "Landing a job as a **React Fresher** in 2026 requires a mix of theoretical knowledge and practical understanding. This guide covers everything from the Virtual DOM to the latest best practices, ensuring you can answer over 50 of the most common interview questions with confidence.",
            "image": "/images/interviews/react-main.png"
        },
        {
            "title": "1. Fundamentals & Architecture (Q1-Q10)",
            "content": "**Q1: What is React?**\nReact is a declarative, efficient, and flexible JavaScript library for building user interfaces. It lets you compose complex UIs from small, isolated pieces of code called 'components'.\n\n**Q2: What are the key features of React?**\nKey features include the Virtual DOM, Server-Side Rendering, Unidirectional Data Flow, and Component-Based Architecture.\n\n**Q3: What is JSX?**\nJSX stands for JavaScript XML. It's a syntax extension for JavaScript that allows you to write HTML-like structure directly in your JavaScript code.\n\n**Q4: Can browsers read JSX?**\nNo, browsers can only read standard JavaScript objects. JSX must be transpiled into regular JavaScript (using Babel) before it reaches the browser.\n\n**Q5: What is the Virtual DOM?**\nA Virtual DOM is a lightweight copy of the real DOM kept in memory. React uses it to calculate the most efficient way to update the actual UI.\n\n**Q6: How does Reconciliation work?**\nReconciliation is the process by which React updates the real DOM. It diffs the new Virtual DOM with the previous version and applies only the necessary changes.\n\n**Q7: Is React a Library or a Framework?**\nReact is a library because it focuses only on the View layer. You need other libraries for routing, state management, and API calls.\n\n**Q8: What is 'One-Way Data Binding'?**\nData in React flows only from parent to child via props. This makes the data flow predictable and easier to debug.\n\n**Q9: What are the advantages of React?**\nIncreased performance with Virtual DOM, reusability of components, strong community support, and easy integration with other libraries.\n\n**Q10: What is create-react-app?**\nA command-line tool used to create a new React project with a pre-configured build setup, though modern alternatives like Vite are now preferred."
        },
        {
            "title": "2. Components & Props (Q11-Q20)",
            "content": "**Q11: What is a Component?**\nComponents are the building blocks of a React UI. They are independent, reusable pieces of code that return JSX.\n\n**Q12: Class vs. Functional Components.**\nClass components use ES6 classes and have lifecycle methods. Functional components are simple functions and use Hooks for state and lifecycles. Functional is now the industry standard.\n\n**Q13: What are Props?**\nProps (Properties) are inputs passed to components. They allow data to be passed from a parent component to a child.\n\n**Q14: Are Props mutable?**\nNo, props are read-only. A component should never modify the props it receives.\n\n**Q15: What is the 'children' prop?**\nA special prop that allows you to pass components as data to other components, enabling nesting.\n\n**Q16: How do you pass a function to a child component?**\nYou pass it as a prop, just like any other piece of data.\n\n**Q17: What is 'Prop Drilling'?**\nThe process of passing props through several layers of components just to reach a deep-nested child.\n\n**Q18: How do you avoid Prop Drilling?**\nBy using React Context API or state management libraries like Redux or Zustand.\n\n**Q19: What is a Pure Component?**\nA component that only re-renders if its props or state change (using a shallow comparison).\n\n**Q20: Can a component return multiple elements?**\nYes, but they must be wrapped in a single parent element or a React Fragment."
        },
        {
            "title": "3. State Management (Q21-Q30)",
            "content": "**Q21: What is State?**\nState is an object that holds information that may change over the lifetime of a component. Unlike props, state is managed within the component.\n\n**Q22: How do you update state in functional components?**\nUsing the updater function returned by the `useState` hook.\n\n**Q23: Why is state update asynchronous?**\nReact batches updates for better performance, ensuring the UI stays responsive.\n\n**Q24: What is the difference between Props and State?**\nProps are external and passed to the component; State is internal and managed by the component.\n\n**Q25: What is 'Lifting State Up'?**\nMoving state to the nearest common ancestor so multiple child components can share and stay in sync with the same data.\n\n**Q26: What is a 'Controlled Component'?**\nA form element whose value is controlled by React state.\n\n**Q27: What is an 'Uncontrolled Component'?**\nA form element that maintains its own internal state in the DOM, accessed via Refs.\n\n**Q28: When to use useState vs useReducer?**\nUse `useState` for simple values; use `useReducer` for complex state logic or when state depends on the previous state.\n\n**Q29: Can you initialize state from props?**\nYes, but it's generally discouraged unless you want to create an internal copy that won't track future prop updates.\n\n**Q30: What happens when state changes?**\nReact schedules a re-render for that component and all its children (unless optimized)."
        },
        {
            "title": "4. Lifecycle & Hooks (Q31-Q40)",
            "content": "**Q31: What are React Hooks?**\nFunctions that let you 'hook into' React state and lifecycle features from functional components.\n\n**Q32: Explain the 'useEffect' hook.**\nA hook for performing side effects (data fetching, DOM updates) in functional components.\n\n**Q33: How to run an effect only once?**\nPass an empty dependency array `[]` as the second argument to `useEffect`.\n\n**Q34: What is the cleanup function in useEffect?**\nA function returned by the effect that runs when the component unmounts or before the effect re-runs.\n\n**Q35: What is 'useRef'?**\nA hook that returns a mutable ref object whose `.current` property persists for the full lifetime of the component.\n\n**Q36: What are the Rules of Hooks?**\nHooks must be called at the top level and only from React functions.\n\n**Q37: What is 'useContext'?**\nA hook that lets you subscribe to React Context without nesting.\n\n**Q38: What is 'useMemo'?**\nA hook that memoizes the result of a calculation to avoid expensive re-computations.\n\n**Q39: What is 'useCallback'?**\nA hook that memoizes a function definition to prevent unnecessary re-renders of children receiving that function as a prop.\n\n**Q40: Why can't we call hooks inside conditions?**\nReact relies on the call order of hooks to link state to the correct hook instance across renders."
        },
        {
            "title": "5. Events, Lists & Performance (Q41-Q50)",
            "content": "**Q41: How do you handle events in React?**\nUsing camelCase naming (e.g., `onClick`) and passing a function as the handler.\n\n**Q42: What is the 'key' prop in lists?**\nA unique identifier that helps React determine which items in a list have changed, added, or removed.\n\n**Q43: Why avoid using array indices as keys?**\nIndices can change if the list is reordered, causing issues with state and performance.\n\n**Q44: What is 'Fragment' in React?**\nA way to group children without adding extra nodes to the DOM.\n\n**Q45: How to perform code splitting in React?**\nUsing `React.lazy` and `Suspense` to load components only when they are needed.\n\n**Q46: What is 'Error Boundary'?**\nA component that catches JavaScript errors in its child component tree and displays a fallback UI.\n\n**Q47: What is the significance of 'React.memo'?**\nA higher-order component that prevents functional components from re-rendering if their props haven't changed.\n\n**Q48: How to optimize React performance?**\nBy using memoization, avoiding anonymous functions in props, and keeping state local as much as possible.\n\n**Q49: What is 'Higher-Order Component' (HOC)?**\nA function that takes a component and returns a new component with added functionality.\n\n**Q50: What is the difference between Shadow DOM and Virtual DOM?**\nShadow DOM is a browser technology for scoped CSS/HTML; Virtual DOM is a React concept for efficient UI updates."
        },
        {
            "title": "Summary & Bonus Question",
            "content": "**Q51: How do you stay updated with React?**\nBy following official blogs, community newsletters, and exploring new features like Server Components and Actions.\n\nThis guide provided a broad overview of **50 essential React questions**. Mastering these will set a strong foundation for any fresher entering the tech industry in 2026.",
            "image": "/images/interviews/react-main.png"
        }
    ]
}