{
    "slug": "react-hooks-interview-questions-for-freshers",
    "title": "50+ React Hooks Interview Questions for Freshers (2026)",
    "description": "The most comprehensive guide to React Hooks for freshers. Over 50 questions covering useState, useEffect, custom hooks, and advanced optimization patterns.",
    "heroBadge": "Hooks Pro Guide: 50+ Q&A",
    "sections": [
        {
            "title": "Introduction: The Era of Modern React",
            "content": "Since React 16.8, **Hooks** have been the definitive way to build components. For a **fresher**, being an expert in Hooks isn't just a plus—it's a requirement. This guide provides 50+ questions and answers to help you master the 'hooked' way of thinking.",
            "image": "/images/interviews/react-main.png"
        },
        {
            "title": "1. Basic Hooks: useState & useEffect (Q1-Q15)",
            "content": "**Q1: What are Hooks?**\nHooks are functions that let you access React state and lifecycle features from functional components.\n\n**Q2: Why were Hooks introduced?**\nTo solve issues like complex class logic, difficult code reuse (wrapper hell), and the confusing 'this' keyword.\n\n**Q3: Explain 'useState'.**\nIt adds local state to a function component. It returns the current state and a function to update it.\n\n**Q4: Can we use multiple 'useState' hooks?**\nYes, you can call it multiple times to manage different state variables independently.\n\n**Q5: What happens when you update state with 'useState'?**\nReact replaces the old state with the new value and triggers a re-render of the component.\n\n**Q6: Explain 'useEffect'.**\nA hook for handling side effects like data fetching, manual DOM mutation, or subscriptions.\n\n**Q7: What is the dependency array in 'useEffect'?**\nAn array of values that the effect depends on. The effect re-runs only when these values change.\n\n**Q8: What if the dependency array is empty `[]`?**\nThe effect runs only once after the initial render, behaving like `componentDidMount`.\n\n**Q9: What if the dependency array is missing?**\nThe effect runs after every single render of the component.\n\n**Q10: What is the cleanup function in 'useEffect'?**\nA function returned by the effect to clean up resources (e.g., clearing intervals or unsubscribing).\n\n**Q11: When does the cleanup function run?**\nBefore the component unmounts and before the effect re-runs with new dependencies.\n\n**Q12: Can 'useEffect' be asynchronous?**\nNo, but you can define and call an async function *inside* the effect.\n\n**Q13: How do you handle component updates with 'useEffect'?**\nBy including the relevant variables in the dependency array.\n\n**Q14: Difference between 'useState' and 'useEffect'?**\n`useState` is for managing data; `useEffect` is for performing actions based on that data changing.\n\n**Q15: What is the 'functional update' pattern in 'useState'?**\nPassing a function to the updater (`setState(prev => prev + 1)`) to ensure you're working with the most recent state value."
        },
        {
            "title": "2. Advanced Built-in Hooks (Q16-Q30)",
            "content": "**Q16: Explain 'useRef'.**\nIt creates a persistent, mutable reference that doesn't trigger a re-render when its value changes.\n\n**Q17: Common use cases for 'useRef'.**\nAccessing DOM elements, storing timers/intervals, or tracking the 'previous' state value.\n\n**Q18: Explain 'useContext'.**\nA hook that accepts a context object and returns the current context value for that context.\n\n**Q19: Explain 'useReducer'.**\nAn alternative to `useState` for complex state logic, similar to the Redux pattern with actions and reducers.\n\n**Q20: When to prefer 'useReducer' over 'useState'?**\nWhen you have state that depends on multiple other states or complex transition logic.\n\n**Q21: Explain 'useMemo'.**\nIt returns a memoized value. It only re-calculates the value when dependencies change.\n\n**Q22: Explain 'useCallback'.**\nIt returns a memoized version of a callback function that only changes if its dependencies change.\n\n**Q23: Difference between 'useMemo' and 'useCallback'?**\n`useMemo` caches a **result**; `useCallback` caches a **function instance**.\n\n**Q24: What is 'useLayoutEffect'?**\nA version of `useEffect` that fires synchronously after all DOM mutations. Use it for reading layout and synchronous re-rendering.\n\n**Q25: 'useEffect' vs 'useLayoutEffect'.**\n`useEffect` is asynchronous and won't block the browser paint; `useLayoutEffect` is synchronous and can block painting.\n\n**Q26: What is 'useImperativeHandle'?**\nA hook that customizes the instance value exposed to parent components when using `ref`.\n\n**Q27: What is 'useDebugValue'?**\nA hook used in custom hooks to display a label for the hook in React DevTools.\n\n**Q28: What is 'useId'?**\nA hook for generating unique IDs that are stable across the server and client.\n\n**Q29: What is 'useTransition'?**\nA hook for marking state updates as transitions that can be interrupted by more urgent updates (like typing).\n\n**Q30: What is 'useDeferredValue'?**\nA hook that accepts a value and returns a new copy of it that will 'defer' updates to it to keep the UI responsive."
        },
        {
            "title": "3. Rules & Custom Hooks (Q31-Q45)",
            "content": "**Q31: What are the Rules of Hooks?**\n1. Only call Hooks at the top level. 2. Only call Hooks from React functions.\n\n**Q32: Why must hooks be at the top level?**\nReact relies on the order of hook calls to maintain state correctly between renders.\n\n**Q33: Can you call a hook inside a loop?**\nNo, it violates the rule of top-level calls.\n\n**Q34: Can you call a hook inside a regular JS function?**\nNo, hooks can only be called from React function components or other custom hooks.\n\n**Q35: What is a Custom Hook?**\nA JavaScript function whose name starts with 'use' and can call other hooks.\n\n**Q36: Why use Custom Hooks?**\nTo share logic between multiple components without repeating code.\n\n**Q37: Do custom hooks share state?**\nNo. Every time you use a custom hook, all state and effects inside it are completely isolated.\n\n**Q38: How to name a custom hook?**\nIt MUST start with the prefix 'use' to allow React to check for hook rule violations.\n\n**Q39: Can a custom hook return anything?**\nYes, it can return values, functions, objects, or even other components (though usually it returns data/functions).\n\n**Q40: Example of a common custom hook.**\n`useWindowSize`, `useFetch`, or `useLocalStorage`.\n\n**Q41: Explain 'stale closures' in Hooks.**\nWhen a hook's callback captures an old value from a previous render because it wasn't listed in the dependency array.\n\n**Q42: How to fix a stale closure in 'useEffect'?**\nBy correctly adding all referenced variables to the dependency array.\n\n**Q43: What is the 'exhaustive-deps' lint rule?**\nA rule that ensures all dependencies used inside a hook are also declared in its dependency array.\n\n**Q44: Can you use hooks in Class components?**\nNo. Hooks are strictly for functional components.\n\n**Q45: How to use a hook's value in a Class component?**\nBy wrapping the class component in a functional component and passing the hook value as a prop."
        },
        {
            "title": "4. Performance & Context (Q46-Q50+)",
            "content": "**Q46: How does 'useContext' help performance?**\nIt simplifies sharing data; however, all consumers re-render when the context value changes.\n\n**Q47: How to optimize 'useContext' re-renders?**\nBy splitting contexts into smaller pieces or memoizing the context provider's value.\n\n**Q48: Best practice for large state in hooks.**\nPrefer `useReducer` to consolidate multiple related state variables.\n\n**Q49: Should you use 'useMemo' everywhere?**\nNo. It has its own overhead. Use it only for truly expensive computations.\n\n**Q50: How to test components that use hooks?**\nUsing tools like React Testing Library and `renderHook` from the hooks testing utility.\n\n**Q51: Future of Hooks.**\nNew hooks like `useActionState` and improved concurrency features are continuously being added to the React core."
        },
        {
            "title": "Summary",
            "content": "Mastering these **50+ Hook questions** will prove your expertise in modern React. Hooks are not just a feature; they are the fundamental language of React development today.",
            "image": "/images/interviews/react-main.png"
        }
    ]
}